---
type: UpdaterInfo
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# UpdaterInfo

`Autodesk.Revit.DB.UpdaterInfo` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Property | AdditionalInformation | 2012 | `public string AdditionalInformation { get ; }` |
| Property | ApplicationName | 2012 | `public string ApplicationName { get ; }` |
| Property | IsOptional | 2012 | `public bool IsOptional { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | UpdaterName | 2012 | `public string UpdaterName { get ; }` |